;主引导程序
;-----------------------------------------------
SECTION MBR vstart=0x7c00
	mov ax, cs
	mov ds, ax
	mov es, ax
	mov ss, ax
	mov fs, ax
	mov sp, 0x7c00

;清屏
;-----------------------------------------------
;功能: 上卷窗口
;ah: 功能号 al: 上卷行数 bh: 上卷行属性
;(cl, ch) 左上角 x、y 位置
;(dl, dh) 右下角 x、y 位置
;无返回值
;-----------------------------------------------
	mov ax, 0x600
	mov bx, 0x700
	mov cx, 0
	mov dx, 0x184f
	int 0x10

;-----------------------------------------------
;功能: 获取当前光标位置
;ah: 功能号 bh: 待获取光标的页号
;输出: ch=光标开始行 cl=光标结束行 dh=光标所在行号 dl=光标所在列号
;-----------------------------------------------
	mov ah, 3
	mov bh, 0
	int 0x10

;-----------------------------------------------
;功能: 打印字符串
;ax: 打印字符串开始地址 bx: 页号及字符属性 cx: 字符串长度
;-----------------------------------------------
	mov ax, message
	mov bp, ax
	mov cx, 5 ;光标地址要用到 dx 寄存器中的内容，cx 可以忽略
	mov ax, 0x1301
	mov bx, 0x2
	int 0x10

	jmp $
	
	message db "1 MBR"
	times 510-($-$$) db 0
	db 0x55, 0xaa
